%使WiFi与zigbee重合子载波数据幅度能量为低
%------------QAM------------------------------
%.设置用的QAM：16,64,256
%---------------------------------------------
%------------area:子载波重合的区域-------------
%1 'area1' %重叠的区间1子载波
%2 'area2'  %重叠的区间2子载波
%3 'area3'   %重叠的区间3子载波
%4 'area4'   %重叠的区间4子载波
%5 'area1_R1'   %重叠的区间1 往右加一个子载波
%6 'area1_R2'  %重叠的区间1 往右加两个子载波
%7 'area2_L1R1'  %重叠的区间2 左右加一个子载波
%8 'area2_L2R2'  %重叠的区间2 左右加两个子载波
%9 'area3_L1R1'  %重叠的区间3 左右加一个子载波
%10 'area3_L2R2'  %重叠的区间3 往右加两个子载波
%11 'area4_L1'   %重叠的区间4子载波 往左加一个子载波
%12 'area4_L2'   %重叠的区间4子载波 往左加两个子载波

%13 'area1_2'   %标准重叠的区间1,2子载波  可以
%14 'area1_3'   %标准重叠的区间1,3子载波   可以
%15 'area1_4'   %标准重叠的区间1,4子载波  可以
%16 'area2_3'   %标准重叠的区间2,3子载波  x 所有编码都不行
%17 'area2_4'   %标准重叠的区间2,4子载波  可以
%18 'area3_4'   %标准重叠的区间3.4子载波  x  3/4 : 34-36随机1-3个出问题   2/3 : 44出问题     5/6可以
%19 test 2,3,4,5,6,7
%---------------------------------------------
%--------------coding-------------------------
% QAM16:1/2,3/4
% QAM64:1/2,2/3,3/4,5/6
% QAM256:1/2,2/3,3/4,5/6
%---------------------------------------------
clc;clear all;
QAM = 256;area=3;coding='2/3';symbolNum=1;
writeLoc = './data/data256.dat';
%1.设置常量
sim_consts = setConsts();
%2.计算position和对应的wantbits
[position, wantbits] = calPositionAndBits(sim_consts,QAM,area,coding);
%3.插入数据
 allData = insertBits2(sim_consts,QAM,position,wantbits,coding,symbolNum);
%4.翻转bit以适应Gnuradio并写入文件
gnuradioPattern(allData,writeLoc);




